<?php

namespace Database\Seeders;

use App\Models\Location;
use Illuminate\Database\Seeder;

class LocationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $locations = [
            [
                'name' => 'Міжнародний аеропорт "Ужгород"',
                'description' => 'Міжнародний аеропорт в місті Ужгород, унікальний тим, що літаки злітають і заходять на посадку через повітряний простір Словаччини. Заснований у 1929 році.',
                'latitude' => 48.634278,
                'longitude' => 22.263356,
                'type' => 'аеропорт',
            ],
            [
                'name' => 'Мукачівський аеродром',
                'description' => 'Колишня військова база, розташована у 6 км на південний захід від міста. Вважалася одним із найкращих на західному кордоні Радянського Союзу. З 1993 року база була закрита.',
                'latitude' => 48.39556,
                'longitude' => 22.68944,
                'type' => 'аеродром',
            ],
            [
                'name' => 'Аеродром в селі Олешник',
                'description' => 'Військовий аеродром, який базувався на околиці села Олешник (раніше Егреш) під час Другої світової війни.',
                'latitude' => 48.085833,
                'longitude' => 22.719444,
                'type' => 'військовий аеродром',
            ],
            [
                'name' => 'Аеродром в селі Черленово',
                'description' => 'Військовий аеродром, який використовувався під час Другої світової війни та в радянський період.',
                'latitude' => 48.175000,
                'longitude' => 23.297778,
                'type' => 'військовий аеродром',
            ],
        ];

        foreach ($locations as $location) {
            Location::create($location);
        }
    }
}
